## Facebook API 介接

In [17]:
import requests
#ACCESSTOKEN = 'EAAC'
APPID = '155917025115555'
APPSECRET = 'e45cd62d5f9098e57799a071614c686a'
ACCESSTOKEN = '{}|{}'.format(APPID,APPSECRET)
res = requests.get('https://graph.facebook.com/v2.12/DoctorKoWJ/posts?access_token={}'.format(ACCESSTOKEN))

In [18]:
jd = res.json()

In [19]:
import pandas
df = pandas.DataFrame(jd['data'])
df.head(3)

,created_time,id,message,story
0,2018-02-08T03:51:12+0000,136845026417486_1238197629615548,地震震垮了建築物，震不垮台灣人的團結。\n\n截至目前爲止，台北市政府已經出動53人、3台車...,NaN
1,2018-02-06T18:47:02+0000,136845026417486_1237095403059104,0206強震，台北市內無重大災情，因此稍早北市搜救隊一共30人已經在松山機場集合，且已由軍機...,NaN
2,2018-02-06T10:28:53+0000,136845026417486_1236405593128085,【出訪筆記：土耳其】\n\n橫跨歐亞的土耳其，本來就是台灣進軍中東市場的重要跳板，作為第一個...,NaN

## 抓取591

In [35]:
import requests
headers = {
 'User-Agent':'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/63.0.3239.132 Safari/537.36'   
}
res = requests.get('https://rent.591.com.tw/home/search/rsList?is_new_list=1&type=1&kind=1&searchtype=1&region=1&section=5&firstRow=30&totalRows=718', headers = headers)
jd = res.json()

In [36]:
import pandas
df = pandas.DataFrame(jd['data']['data'])
df.head(3)

,addInfo,addition2,addition3,addition4,addr_number_name,address,address_img,address_img_title,alley_name,allfloor,...,storeprice,street_name,streetid,type,unit,updatetime,user_id,vipBorder,vipimg,vipstyle
0,"<img src=""./images/index/userCenter/list_vip_v...",0,0,0,209號,金山南路二段[屋主自租免..,[屋主自租免仲介費]三面採光古亭東門師大,[屋主自租免仲介費]三面採光古亭東門師大,,4,...,0,金山南路二段,25642,1,元/月,1516537049,672616,vipStyle,"<img src=""./images/index/userCenter/list_vip_v...",isvip
1,"<img src=""./images/index/userCenter/list_vip_v...",0,0,0,,信義路三段大安森林公園旁..,"大安森林公園旁,高品質生活景觀宅","大安森林公園旁,高品質生活景觀宅",,10,...,0,信義路三段,25647,1,元/月,1517386676,1088138,vipStyle,"<img src=""./images/index/userCenter/list_vip_v...",isvip
2,"<img src=""./images/index/userCenter/list_vip_v...",0,0,0,65號,龍泉街WELIVE時尚捷運兩房..,WELIVE時尚捷運兩房新、乾淨、便宜,WELIVE時尚捷運兩房新、乾淨、便宜,,5,...,0,龍泉街,25676,1,元/月,1518076303,1327815,vipStyle,"<img src=""./images/index/userCenter/list_vip_v...",isvip

In [37]:
df = df[['address','floor','allfloor','layout','area','price','browsenum_all']]
df.head()

             address  floor  allfloor  layout  area   price  browsenum_all
0     金山南路二段[屋主自租免..      2         4  2房2廳1衛  26.0  32,500           1048
1     信義路三段大安森林公園旁..      3        10  2房2廳1衛  23.0  38,000            477
2  龍泉街WELIVE時尚捷運兩房..      4         5  2房1廳1衛  20.0  22,800            696
3  敦化南路一段160巷SOGO捷..      4         4  2房1廳1衛  10.0  25,000           1823
4    忠孝東路四段216巷明曜靜..      2         7  4房2廳2衛  50.0  50,000            488

In [39]:
df.to_excel('house591.xlsx')

In [40]:
#https://rent.591.com.tw/home/search/rsList?is_new_list=1&type=1&kind=1&searchtype=1&region=1&section=5&firstRow=30&totalRows=718
#https://rent.591.com.tw/home/search/rsList?is_new_list=1&type=1&kind=1&searchtype=1&region=1&section=5&firstRow=60&totalRows=718

In [56]:
import requests
headers = {
 'User-Agent':'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/63.0.3239.132 Safari/537.36'   
}
url = 'https://rent.591.com.tw/home/search/rsList?is_new_list=1&type=1&kind=1&searchtype=1&region=1&section=5&firstRow={}&totalRows=718'

house_ary = []
for i in range(0,int(718 / 30) + 1):
    res = requests.get(url.format(i*30), headers = headers)
    jd = res.json()
    df = pandas.DataFrame(jd['data']['data'])
    df = df[['id','address','floor','allfloor','layout','area','price','browsenum_all']]
    house_ary.append(df)

In [57]:
len(house_ary)

24

In [58]:
df = pandas.concat(house_ary)

In [59]:
df['price'] = df['price'].map(lambda e: int(e.replace(',', '')))

In [65]:
df.sort_values('browsenum_all', ascending=False).head(3)

,id,address,floor,allfloor,layout,area,price,browsenum_all
29,5991006,愛國東路學生公寓，屋主..,3,4,6房2廳6衛,66.0,8800,4469
17,5989953,羅斯福路三段333巷限女性台大..,5,5,2房0廳1衛,17.0,11900,3459
19,6028693,建國南路一段291巷必定排隊搶..,7,14,3房2廳2衛,32.0,33000,3013

In [62]:
df.to_excel('house591.xlsx')

In [63]:
house = pandas.read_excel('house591.xlsx')

In [64]:
house.head(3)

,id,address,floor,allfloor,layout,area,price,browsenum_all
0,6018145,四維路52巷大安站全新飯店..,4,5,2房1廳1衛,22.0,35000,2293
1,6030022,信義路三段台北大安森林公..,12,14,1房2廳1衛,14.0,36000,909
2,6049021,忠孝東路四段223巷﻿﻿忠..,4,7,3房2廳2衛,39.6,46000,405

## 抓取自由時報的資料

In [67]:
import requests
from bs4 import BeautifulSoup
res = requests.get('http://news.ltn.com.tw/list/breakingnews')
soup = BeautifulSoup(res.text, 'lxml')

In [83]:
news_ary = []

for news in soup.select('.imm li'):
    title  = news.select_one('a.tit p').text.strip()
    dt     = news.select_one('a.tit span').text.strip()
    url    = news.select_one('a.tit')['href']
    tag    = ','.join([ele.text for ele in news.select_one('.tagarea').select('.immtag')])
    news_ary.append({'title':title, 'dt':dt, 'url':url,'tag':tag})
    #print('===============================')

In [85]:
newsdf = pandas.DataFrame(news_ary)
newsdf.head()

,dt,tag,title,url
0,11:04,"社會,花蓮縣",雲門翠堤續搜救突破201號房地板 徒手開挖中,http://news.ltn.com.tw/news/society/breakingne...
1,10:57,國際,女醉倒賭城路邊 股溝男當眾猥褻笑嗨嗨,http://news.ltn.com.tw/news/world/breakingnews...
2,10:53,"社會,臺中市",暗夜惡火 女子疑逃生不及葬身火窟,http://news.ltn.com.tw/news/society/breakingne...
3,10:50,"生活,花蓮縣",國興六街拆樓清出瓦斯桶 業者怨想搬受阻,http://news.ltn.com.tw/news/life/breakingnews/...
4,10:48,"社會,臺東縣",黑鷹墜诲 紀德艦加入搜索,http://news.ltn.com.tw/news/society/breakingne...

In [86]:
newsdf.to_excel('ltn.xlsx')

In [82]:
l = ['a', 'b', 'c']
';'.join(l)

'a;b;c'

## 資料清理

In [88]:
a = [1,3,5,7,9]
b = [2,4,6,8,10]

for i in range(0, len(a)):
    print(a[i] * b[i])

2
12
30
56
90

In [91]:
for i,j in zip(a,b):
    print(i * j)

2
12
30
56
90

In [92]:
[i * j for i,j in zip(a,b)]

[2, 12, 30, 56, 90]

In [93]:
import numpy

a = [1,3,5,7,9]
b = [2,4,6,8,10]

na = numpy.array(a)
nb = numpy.array(b)

In [96]:
na * nb

array([ 2, 12, 30, 56, 90])

In [97]:
na - nb

array([-1, -1, -1, -1, -1])

In [98]:
import numpy as np
a = [1,2,3,4,5]
na = np.array(a)

In [101]:
na[0]

1

In [103]:
na[1:3]

array([2, 3])

In [104]:
na > 3

array([False, False, False,  True,  True], dtype=bool)

In [105]:
na[na > 3]

array([4, 5])

In [106]:
na = np.array(
    [
        [1,2,3,4,5],
        [6,7,8,9,10]
    ])

In [108]:
na[0,0]

1

In [109]:
na[0,:]

array([1, 2, 3, 4, 5])

In [110]:
na[:,0]

array([1, 6])

In [111]:
na.T

array([[ 1,  6],
       [ 2,  7],
       [ 3,  8],
       [ 4,  9],
       [ 5, 10]])

In [112]:
na=np.array([
    ['frank','M',29],
    ['mary','F',23],
    ['tom','M',35],
    ['ted','M',33],
    ['jean','F',21],
    ['lisa','F',20]
])

In [113]:
na

array([['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']],
      dtype='<U5')

In [115]:
na=np.array([
    ['name', 'gender', 'age'],
    ['frank','M',29],
    ['mary','F',23],
    ['tom','M',35],
    ['ted','M',33],
    ['jean','F',21],
    ['lisa','F',20]
])

In [117]:
na

array([['name', 'gender', 'age'],
       ['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']],
      dtype='<U6')

In [118]:
na[1:,:]

array([['frank', 'M', '29'],
       ['mary', 'F', '23'],
       ['tom', 'M', '35'],
       ['ted', 'M', '33'],
       ['jean', 'F', '21'],
       ['lisa', 'F', '20']],
      dtype='<U6')

In [119]:
na[1:,1]

array(['M', 'F', 'M', 'M', 'F', 'F'],
      dtype='<U6')

In [120]:
import pandas
df = pandas.DataFrame([
    ['frank','M',29],
    ['mary','F',23],
    ['tom','M',35],
    ['ted','M',33],
    ['jean','F',21],
    ['lisa','F',20]
])

In [121]:
df

       0  1   2
0  frank  M  29
1   mary  F  23
2    tom  M  35
3    ted  M  33
4   jean  F  21
5   lisa  F  20

In [122]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [123]:
df.columns = ['name', 'gender', 'age']

In [124]:
df

    name gender  age
0  frank      M   29
1   mary      F   23
2    tom      M   35
3    ted      M   33
4   jean      F   21
5   lisa      F   20

In [127]:
import pandas as pd
s=pd.Series([21000,18900,18000])
s

0    21000
1    18900
2    18000
dtype: int64

In [128]:
s=pd.Series([21000,18900,18000],index=['Iphone','Edge S7','HTC M1'])
s

Iphone     21000
Edge S7    18900
HTC M1     18000
dtype: int64

In [129]:
s= pd.Series({'Iphone':21000,'Edge S7':18900,'HTC M1':18000})
s

Edge S7    18900
HTC M1     18000
Iphone     21000
dtype: int64

In [131]:
s[2]

21000

In [132]:
s[1:3]

HTC M1    18000
Iphone    21000
dtype: int64

In [134]:
s['Iphone']

21000

In [135]:
s[['Iphone', 'Edge S7']]

Iphone     21000
Edge S7    18900
dtype: int64

In [136]:
s < 20000

Edge S7     True
HTC M1      True
Iphone     False
dtype: bool

In [137]:
s[s<20000]

Edge S7    18900
HTC M1     18000
dtype: int64

In [138]:
cheap = s < 20000
cheap

Edge S7     True
HTC M1      True
Iphone     False
dtype: bool

In [139]:
s[cheap]

Edge S7    18900
HTC M1     18000
dtype: int64

In [140]:
s['Iphone']

21000

In [141]:
s['Iphone'] = 20000

In [142]:
s['Iphone']

20000

In [143]:
s

Edge S7    18900
HTC M1     18000
Iphone     20000
dtype: int64

In [145]:
s[s<20000] * 0.8

Edge S7    15120.0
HTC M1     14400.0
dtype: float64

In [146]:
s[s<20000]=s[s<20000] * 0.8
s

Edge S7    15120
HTC M1     14400
Iphone     20000
dtype: int64

In [147]:
'Iphone' in s

True

In [148]:
'mi' in s

False

In [149]:
s * 0.8

Edge S7    12096.0
HTC M1     11520.0
Iphone     16000.0
dtype: float64

In [151]:
import numpy as np
#print(dir(np))
np.sqrt(s)

Edge S7    122.963409
HTC M1     120.000000
Iphone     141.421356
dtype: float64

In [152]:
s.max()

20000

In [153]:
s.mean()

16506.666666666668

In [154]:
s.describe()

count        3.000000
mean     16506.666667
std       3046.659373
min      14400.000000
25%      14760.000000
50%      15120.000000
75%      17560.000000
max      20000.000000
dtype: float64

In [155]:
s[['Iphone','HTC M1']]

Iphone    20000
HTC M1    14400
dtype: int64

In [156]:
s[['mi','HTC M1']]

mi            NaN
HTC M1    14400.0
dtype: float64

In [157]:
s2 = s[['Iphone','HTC M1']] + s[['mi','HTC M1']]

In [158]:
s2

HTC M1    28800.0
Iphone        NaN
mi            NaN
dtype: float64

In [160]:
s2.isnull()

HTC M1    False
Iphone     True
mi         True
dtype: bool

In [162]:
sum(s2.isnull())

2

In [163]:
s2.notnull()

HTC M1     True
Iphone    False
mi        False
dtype: bool

In [164]:
sum(s2.notnull())

1